const itemDesc=[
    { 
      name: "강아지 사료", cost: 50, type: "snack", color: [255, 200, 0],
      desc: "유기견에게 사료는 필수죠!\n적당한 사거리와 속도로 한 마리의 강아지를 회복시킵니다." 
    },
    { 
      name: "치유의 소화전", cost: 100, type: "heal", color: [0, 200, 255],
      desc: "강아지들이 좋아하는 소화전입니다.\n폭발하며 주위의 강아지들까지 함께 회복시켜요."
    },
    { 
      name: "사랑이 가득한 집", cost: 100, type: "love", color: [100, 255, 100],
      desc: "강아지들에게 사랑을 듬뿍 나눠줘요.\n하트는 일직선상으로 날아가며 경로 상의 모든 강아지들을 회복시킵니다."
    },
    { 
      name: "공포의 목욕시간", cost: 120, type: "slow", color: [0, 0, 255],
      desc: "저는 이제 아무것도 무섭지 않아요.\n 목욕을 제외하면요...\n 목욕은 강아지들을 느려지게 만들어요. "
    },
    { 
      name: "집중 케어", cost: 150, type: "antiTanker", color: [200, 100, 100],
      desc: "한마리만 골라서 초강력 집중케어에 들어간다! \n 집중케어 타워의 표적이 되면 구조될때까지 집요하게 회복시킵니다."
    },
    { 
      name: "강아지를 찾습니다", cost: 100, type: "block", color: [150, 100, 50],
      desc: "유기견을 애타게 찾고 있는 주인이 있네요!\n 경로 상에 설치하면 강아지들을 집으로 돌려보낼 수 있습니다."
    },
    { 
      name: "놀이터 타워", cost: 100, type: "playground", color: [255, 0, 0],
      desc: "잠깐 놀다가 갈까? 강아지들의 정신을 쏙 빼놓는 놀이터입니다. \n 경로 상에 설치하면 강아지들이 잠시 멈춥니다."
    },
    { 
      name: "푸들 요정의 가호", cost: 150, type: "support", color: [150, 0, 255],
      desc: "내가 너희들에게 가호를 내리겠노라.\n푸들 신의 가호를 받은 주변 타워들은 강력해집니다."
    },
    { 
      name: "황금 뼈다귀 사원", cost: 200, type: "factory", color: [255, 128, 0],
      desc: "황금 뼈다귀를 숭배하라!\n일정 시간마다 골드를 생산하는 타워입니다."
    },
  ];